Repository: 84000/data-translation-memory
Catalog: toh381_84000-emergence-from-samputa.tmx
Source language: bo
Languages: en

source: །གྱོ་མོ་ལ་མངོན་པར་བསྔགས་ནས་སྟེང་དང་། འོག་དང་། ཕྱོགས་དང་། མཚམས་སུ་གཏོར་བ་བྱས་ན་ལྷ་ཐམས་ཅད་དང་། ལྷ་མ་ཡིན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་བཅིངས་པ་དང་། མཁའ་འགྲོ་མ་ཐམས་ཅད་ཀྱི་སྦྱོར་བ་འཕྲོག་པ་དང་། ཀླུ་ཐམས་ཅད་ཀྱི་དུག་འཕྲོག་པར་འགྱུར་རོ།
en: Having incanted a bowl of candied sugar, he should throw the sugar in the cardinal and intermediate directions, above and below. As a result, the gods, demigods, yakṣas, rākṣasas, gandharvas, kinnaras, and mahoragas will all become bound. He will steal magical potions from all the ḍākinīs and poisons from all the nāgas.

source: །གྱོ་མོ་ལ་ཡོངས་སུ་བཟླས་ནས་ཆུ་ལ་གཏོར་ན་རྒྱུན་ལས་བཟློག་ནས་འབབ་པར་འགྱུར་རོ།
en: If he incants candied sugar and throws it into a river, the river will flow upstream.

source: །གྱོ་མོ་དེ་ཉིད་ཀྱིས་རྦ་རླབས་རེངས་པར་བྱེད་དོ།
en: With the same candied sugar he will be able to arrest the waves.

source: །སྟེང་དུ་བལྟས་ནས་སྟོང་བཟླས་ན་ཆར་ཆེན་པོ་ཟློག་པར་བྱེད་དོ།
en: If he recites the mantra 1,000 times while facing upward, he can prevent a heavy rain from falling.

source: །ཕ་རོལ་གྱི་དཔུང་ལ་ཁ་བལྟས་ནས་སྟོང་བཟླས་པ་བྱས་ནས་གཡུལ་དུ་ཞུགས་ན་མཚོན་བརྒྱ་ཡིས་བསྣུན་ཀྱང་ན་བ་སྐྱེ་བར་མི་འགྱུར་ཏེ།
en: If he recites the mantra 1,000 times in the direction of an enemy army, and then enters battle, he will meet with no harm even when struck with hundreds of weapons.

source: མཚོན་གྱིས་ཆོད་པར་མི་འགྱུར་ཞིང་རྡོ་རྗེའི་ལུས་སུ་འགྱུར་བ་དང་། ངོ་མཚར་དུ་མ་བྱེད་པར་འགྱུར་བ་དང་། སྔགས་ཀྱི་རྒྱལ་པོས་བསྐུལ་བས་རྩེ་བར་འགྱུར་རོ།
en: He cannot be chopped up. His body becomes a diamond body. He will perform many miracles, and will play with deities invoked by this king of mantras.”

source: །བདུན་པ་ལས་རྒྱས་པའི་འཁོར་ལོ་འབྱུང་བ་ཞེས་བྱ་བ་སྟེ་རབ་ཏུ་བྱེད་པ་གསུམ་པའོ།།
en: This concludes the third part of the seventh chapter, called “The Benefits of Yantra-Wheels Used for the Complete Range of Activity.”

source: །།རབ་གནས་མཚན་ཉིད་བཟང་པོ་ནི།
en: “May the lord explain the fine details

source: །རིམ་པ་ཇི་ལྟར་བཤད་དུ་གསོལ།
en: Of consecration rites, how they should be performed—

source: །བཟླས་དང་བསམ་གཏན་མི་འཚལ་བས།
en: I do not know about the mantra recitation and meditation.

source: །སྦྱིན་སྲེག་ལས་ཆོ་ག་ཇི་ལྟར་ལགས།
en: And what is the right procedure for the rite of homa?

source: །བཅོམ་ལྡན་རྡོ་རྗེ་སྙིང་པོ་བདག །ཆོས་ཀུན་གཅིག་ཏུ་བསྡུས་པ་ཡི།
en: “Blessed One, in your being you are the essence of vajra,

source: །དགྱེས་པ་ཆེན་པོ་རྙེད་དཀའ་བས།
en: The fusion of all sublime qualities.

source: །བཀའ་དྲིན་གྱིས་ནི་བསྐྱབ་ཏུ་གསོལ།
en: Please teach out of your kindness, You who possess great bliss, and are so difficult to find.”

source: །བསམ་གཏན་ལས་ཆོ་ག་ཇི་ལྟ་བར།
en: “Listen O goddess!

source: །བཤད་པར་བྱ་ཡིས་ལྷ་མོ་ཉོན།
en: I will explain the act Of meditation according to its prescribed routine.

source: །བསམ་གཏན་ཙམ་གྱིས་སྦྱོར་བས་ནི།
en: Through methods involving merely meditation

source: །ལས་རྣམས་ཐམས་ཅད་བསྒྲུབ་པར་བྱ།
en: One will be able to accomplish all actions.”

source: །དེ་ལ་དང་པོར་ས་སྦྱང་བ་བཤད་པའི་ཕྱིར་བཀའ་སྩལ་པ།
en: Then, to first explain the purification of the ground, the Blessed One said:

source: རྡོ་རྗེ་སེམས་དཔར་བསྙེམས་བྱས་ནས།
en: “One should assume the divine pride of Vajrasattva

source: །ཁེངས་བཙས་གཉིས་མེད་ཡང་དག་གནས།
en: And establish oneself in the nonduality that accompanies such pride.

source: །འཇིག་རྟེན་གསུམ་རྒྱལ་གྱུར་ནས་ནི། །བགེགས་རྣམས་ཐམས་ཅད་བསྐྲད་པར་བྱ།
en: Having become the conqueror of the three worlds, One should uproot all obstacle makers. “One should position one’s feet as instructed

source: །རྐང་པའི་དགོད་པ་ཅི་གསུངས་དང་། །དེ་བཞིན་དུ་ནི་ལྷ་རྣམས་ཉིད།
en: And so also the feet of the goddesses.

source: །སྦྱིན་སྲེག་ལས་ནི་ཅི་གསུངས་དང་། །ཐབ་ཁུང་གི་ནི་མཚན་ཉིད་དང་། །དེ་ནས་ཕྱག་རྒྱ་སྦྱོར་བྱས་ནས།
en: The homa rite should be as has been taught And so should be the characteristics of the fire pit. “Then one should apply the hand gestures,

source: །ཕྱི་ནས་དཀྱིལ་འཁོར་བྲི་བར་བྱ།
en: And later draw the maṇḍala.

source: །ཁྲོ་བོ་རྣམ་པར་རྒྱལ་བ་ཞལ་གསུམ་པ་ཕྱག་དྲུག་པར་གྱུར་པ་བསྒོམས་ནས།
en: “Becoming the deity Krodhavijaya, one should visualize oneself as having three faces and six arms.

source: ཁྲོ་བོའི་སྤྲིན་ཕྱུང་སྟེ། དེ་ཉིད་ཀྱིས་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་འཁོར་དང་བཅས་པ་ལ་ཁྱེད་རྣམས་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་གནས་སུ་དགོངས་པ་མཛད་པ་དང་། སློབ་དཔོན་དང་དེའི་སློབ་མ་རྣམས་བསྲུང་བ་མཛད་དུ་གསོལ་ཞེས་བསྐུལ་ལོ། །དེ་ནས་དེ་བསྡུས་ནས་ནང་དུ་བཅུག་སྟེ། རང་གི་སྙིང་གར་ཟླ་བ་ལ་རིགས་ཀྱི་བདག་པོའི་ལྟེ་བའི་ནང་དུ་ཧཱུྃ་གནས་པར་བྱས་ནས།
en: One should radiate cloud masses of Krodhavijayas, which invoke all the tathāgatas and their retinues throughout the ten directions, supplicating them, ‘May you please attend to the places of consecration and provide protection for the teacher and his disciples.’ One should then absorb the Krodhavijayas, along with the supplicated tathāgatas, and internalize them, placing them in a hūṁ syllable at the hub of a vajra scepter on a moon disk in one’s heart.

source: དེ་ཡང་རྡོ་རྗེ་འཛིན་པའི་གཟུགས་རང་གི་རིག་མ་དང་། རྣལ་འབྱོར་མ་དང་། བཅོམ་ལྡན་འདས་ལྷན་ཅིག་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་གཅིག་ཏུ་འདྲེས་པར་གྱུར་པས་དང་པོའི་ཡི་གེ་གསུམ་གྱིས་བྱིན་གྱིས་བརླབ་ཅིང་།
en: Having fused the form of Vajradhara, in union with his consort , with all the blessed tathāgatas, one should form the mudrā called ‘the turning of the lotus,’ preceded by the blessing with the three-letter consecration, and then perform the required set of motions with the vajra scepter in one’s right hand.

source: འདོད་པའི་བསྐོར་བ་བྱས་ནས་ལག་པ་གཡས་པས་རྡོ་རྗེ་གསོར་བར་བྱ་བ་དང་། གཡོན་པས་དྲིལ་བུ་སྒྲ་སྙན་པར་དཀྲོལ་བར་བྱའོ།
en: With one’s left hand, one should sound the bell harmoniously.

source: །རྐང་པའི་མཐིལ་དུ་ཧཱུྃ་ལས་རྡོ་རྗེ་འབར་བ་དགོད་པར་བྱ་ཞིང་།
en: On the soles of one’s feet one should visualize a syllable hūṁ which transforms into a blazing vajra scepter.

source: ཁྲོ་བོ་ཧཱུྃ་མཛད་ཀྱི་ང་རྒྱལ་གྱིས་བློ་དང་ལྡན་པས་དང་པོར་ཧཱུྃ་བརྗོད་པས་བསྐྲད་པར་བྱའོ། །ལྷ་དང་། ལྷ་མ་ཡིན་དང་། གསང་བ་པ་གདུག་པ་ཅན་ཐམས་ཅད་ལ་ཁྲོ་བོའི་སྐུར་བསྒོམས་པས། ཚིག་འདི་དག་བརྗོད་པར་བྱ་སྟེ།
en: Then, with the pride of being Krodhavijaya who makes the sound hūṁ , a wise practitioner should expel all obstructors, first by exclaiming hūṁ , and then by addressing the following words, while visualizing himself in Krodha’s form, to the gods, demigods, and guhyakas:

source: གང་ཡང་ལྷ་དང་། ལྷ་མ་ཡིན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། བརྗེད་བྱེད་དང་། འབྱུང་པོ་དང་། མཁའ་འགྲོ་མ་དང་། ལུས་སྲུལ་པོ་དང་། གནོན་པོ་མཐུ་ཆེ་ཞིང་རྫུ་འཕྲུལ་ཆེ་བ་རྗེས་སུ་འབྲང་བའི་འཁོར་དང་བཅས་པ་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། རིག་སྔགས་གྲུབ་པ་ཁྱེད་སོང་ཤིག །སའི་ཕྱོགས་འདིར་སློབ་དཔོན་ཆེ་གེ་མོ་ཞེས་བྱ་བའི་སློབ་མ་ཆེ་གེ་མོ་ཞེས་བྱ་བ་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་བྱ་བའི་དོན་དང་། སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱ་བའི་ཕྱིར་དཀྱིལ་འཁོར་གྱི་རྒྱལ་པོ་ཆེ་གེ་མོ་ཞེས་བྱ་བ་འདྲི་བས་རྡོ་རྗེ་འཛིན་པའི་བཀའ་ཐོས་ནས་དེ་དག་མྱུར་བ་ཉིད་དུ་སོང་ཤིག །གང་ཞིག་མི་འགྲོ་བ་དེ་དག་ལག་ན་རྡོ་རྗེ་ཧཱུྃ་མཛད་ཁྲོས་པའི་གདོང་རབ་ཏུ་འབར་བ་ཀུན་ཏུ་འབར་ཞིང་རབ་ཏུ་འབར་བས་ཡེ་ཤེས་ཆེན་པོའི་རྡོ་རྗེའི་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་མགོ་བོ་བརྒྱར་འགས་པར་འགྱུར་རོ་ཞེས་ལན་གསུམ་དུ་བརྗོད་དོ། །རྡོ་རྗེ་ཆེན་པོ་ལག་པར་བཟུང་ནས་རང་གི་རྡོ་རྗེ་ལས་ཁྲོ་བོའི་སྐུ་བཏོན་ཏེ། རྡོ་རྗེའི་རྐང་པས་དཀྱིལ་འཁོར་གྱིས་ཀུན་ཏུ་བསྐོར་ཞིང་ཡོངས་སུ་བཅགས་པས་གདུག་པ་ཅན་ཐམས་ཅད་བསྐྲད་པར་བྱའོ།
en: ‘May all gods, demigods, yakṣas, rākṣasas, pretas, piśācas, apasmaras, bhūtas, ḍākinīs, ostārakas, male and female elders—all with their retinues of followers —garuḍas, kinnaras, and semi-divine adepts of spells, depart! A regal maṇḍala of such and such a deity needs to be drawn at this place in order that such and such a student attains a perfect awakening under the guidance of such and such a master, and in order that all beings obtain unsurpassable wisdom. You must therefore swiftly depart upon hearing this command by Vajradhara. If anyone does not run away, then Vajrapāṇi, the blazing Hūṁkāra with an angry face, will split his head into a hundred pieces with the brightly shining vajra scepter of great wisdom!’ “When this command has been pronounced three times, he should radiate wrathful forms of himself as Krodhavijaya while doing the ritual movements with his great vajra scepter. Walking around the maṇḍala ground, tempestuously, with a vajra step, he should drive away all mischief-makers.

source: །དེ་ལྟར་ས་ཡོངས་སུ་གཟུང་བ་ཡིན་ནོ།
en: Thus should he claim the ground.

source: །དེ་ནས་སའི་ལྷ་མོ་དགུག་པའི་སྔགས་ཀྱིས་བྱིན་གྱིས་བརླབ་པ་ལ་སོགས་པ་བྱ་ཞིང་། བླ་མ་ལ་ཕྱག་འཚལ་ནས་སྔགས་ཀྱི་མཁན་པོ་ཕྱག་འཚལ་ཏེ།
en: “Then, having summoned the earth goddess, he should perform by means of the mantra the consecration and the tutelage rites. He should pay homage to his master—his mantra instructor—and afterward summon, cause to enter, and bind the gold-colored earth goddess who is holding a pitcher in her hand.

source: ཕྱིས་སའི་ལྷ་མོ་གསེར་གྱི་ཁ་དོག་ཅན་བུམ་པ་ལག་ན་ཐོགས་པ་བཀུག་ཅིང་བཅུག་སྟེ་བཅིངས་ནས་དྲི་ཞིམ་པོ་ལ་སོགས་པའི་མཆོད་པ་ལྔ་པོ་རྣམས་ཀྱིས་ཡང་དག་པར་མཆོད་ཅིང་།
en: He should worship her with the five types of service involving fragrant perfume, and so forth.

source: ལྷག་པར་གནས་ནས་ཉེ་བར་བྱའོ།
en: After he has made her occupy the maṇḍala ground, he should remain near her.”

source: །དེའི་དགུག་པའི་སྔགས་བཀའ་སྩལ་པ།
en: Now the Blessed One gave the mantra of summoning:

source: ཨོཾ་ཨེ་ཧྱེ་ཧི་མ་ཧཱ་དེ་བཱི་པྲྀ་ཐི་བཱི་ལོ་ཀ་མཱ་ཏ་རེ།
en: Oṁ , come, come!

source: སརྦྦ་རཏྣ་སཾ་པུརྞྞེ་དི་བྱ་ལཾ་ཀཱ་ར་བྷཱུ་ཥི་ཏེ་ཧཱ་ར་ནཱུ་པཱུ་ར་ནི་རྒྷོ་ཥེ། བཛྲ་སཏྭ་པྲ་པཱུ་ཛི་ཏེ།
en: O great goddess, mother of the earthly realm, adorned with all the richly bejeweled ornaments, resounding with the tinkling of necklaces and anklets, you who are so bountifully worshiped by Vajrasattva!

source: གྲྀ་ཧཱི་ཏྭཱ་ཨི་ད་མརྒ་ཧོ་མ་ཀརྨྨ་སུ་སཱ་དྷ་ཡེ་ཏ།
en: Take this welcome offering and bring success to the homa rites!

source: ཧཱི་ཧཱི་ཧཱི་ཧཱི་ཧྃ་སྭཱ་ཧཱ།
en: Hrī hī hī hī haṁ ! Svāhā

source: སྔགས་འདིས་སྟ་གོན་ལ་གནས་པ་ལ་སོགས་པ་བྱས་ནས་ས་བྱུག་པ་བྱ་བའི་ཕྱིར་བཤང་བ་དང་གཅི་བ་ལ་སོགས་པ་བསང་གཏོར་བྱས་ཏེ་བྱུག་པར་བྱའོ།
en: “Having performed with this mantra the rite of the goddess’s tutelage over the maṇḍala, he should perform the anointing of the ground. He should thus sprinkle and smear the ground with feces, urine, and so forth.

source: །དེ་ནས་ཤ་ཆེན་གྱི་བདུག་པས་བདུག་པར་བྱའོ།
en: He should then cense it with an incense of human flesh.

source: །བདུགས་མ་ཐག་ཏུ་མཆོད་ནས་དེ་ལ་དབུས་སུ་ཕྱག་རྒྱ་གཞག་པ་ནི་རིག་མ་རབ་ཏུ་གཞུག་པར་བྱའོ།
en: After censing the ground, he should make offerings, and then place the ‘seal’ in the center, meaning he should usher in the consort

source: །ཅི་ལགས་བཅོམ་ལྡན་འདས་ལུགས་མ་དང་། འདུས་བྱས་པ་དང་། རི་མོ་སྣ་ཚོགས་དང་། ཤིང་ལ་སོགས་པ་ལས་བྱས་པའི་རིག་མའི་ལྷ་མོ་གཞུག་པར་བགྱི་ཞེས་གསུངས་སམ།
en: Vajragarbha asked: “Should he, O Blessed One, usher in a consort -goddess who has been cast or otherwise artificially made, drawn in whatever way, or fashioned from wood or other such materials?”

source: གདོལ་པ་ལ་སོགས་པའི་མིའི་བུ་མོ་གཞུག་པར་བྱའོ།
en: “He should usher in a human girl of the cāṇḍāla or similar caste.

source: །དེའི་དངོས་པོ་མེད་ན་གཞན་ཕལ་པ་མཆོག་གི་ཡན་ལག་ལ་ཧྲཱིའི་སྔགས་དགོད་པར་བྱའོ།
en: If such cannot be procured, he should take one from a caste different from his own. He should place the mantra syllables on her body.

source: །ཡན་ལག་ཐམས་ཅད་ལ་ཞེས་བྱ་བ་ནི་སྙིང་ག་དང་། སྨིན་མཚམས་དང་། ལྐོག་མ་དང་། སྤྱི་བོ་རྣམས་སུ་ཧྲཱིཿདང་། བྷ་གའི་དབུས་སུ་བྷྲུྃ་དགོད་པར་བྱའོ།
en: The syllable hrīḥ should be placed on all her limbs. The syllable hrīṁ should be placed on her chest, between her eyebrows, on her throat and head. The syllable bhruṁ should be placed in the center of her vulva.”

source: །ཅི་བཅོམ་ལྡན་འདས་གོང་དུ་དེ་རྣམས་ཀྱི་དབུས་སུ་བྷུྃ་དགོད་པ་ལགས།
en: “And where, O Blessed One, should the syllable bhrūṁ be placed, in the middle of her body?”

source: རིགས་ཀྱི་བུ་ཉོན་ཅིག །དབུས་ཀྱི་སྒྲས་ནི་ལྟེ་བར་གསུངས་སོ།
en: “By the word middle , O sons of the buddha family, navel is meant.

source: །དེར་བྷུྃ་དགོད་པར་བྱའོ། །དེར་ཡི་གེ་བཀོད་ནས་སྤྱན་ལ་སོགས་པའི་གཟུགས་སུ་བསྒོམ་པར་བྱ་ཞེས་བཀའ་སྩལ་ཏོ། །སྤྱན་གྱི་དབྱིབས་སུ་བསྒོམ་པར་བྱ་ཞིང་།
en: There he should place the syllable bhrūṁ . Having thus placed the syllables, he should visualize the forms of Locanā and other tathāgata consorts

source: །དེར་བྲམ་ཟེ་མོའམ།
en: At this point, he should visualize a brahmin or a śūdra consort in the form of Locanā—if it is the rite of pacifying, it should be the form of Locanā.

source: དམངས་མོ་ཞི་བ་ལ་སྤྱན་གྱི་རྣམ་པ་ཞེས་བྱ་བ་ཁ་དོག་དཀར་མོ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པར་བསྒོམ་པར་བྱའོ།
en: He should visualize her as white and adorned with all manner of jewelry.

source: །དབང་ལ་གདོལ་པ་མོ་སྒྲོལ་མ་ཁ་དོག་དམར་མོ་བསྒོམ་པར་བྱའོ།
en: If it is the rite of enthralling, he should visualize a woman from the cāṇḍāla caste in the form of red Tārā.

source: །རྒྱས་པ་ལ་གར་མ་དང་རྒྱལ་རིགས་དག་གོས་དཀར་མོ་ཁ་དོག་སེར་མོའོ།
en: If it is the rite of enriching, he should visualize a dancer woman or a woman of royal lineage as the yellow Pāṇḍaravāsinī.

source: །དེ་ལྟར་ལས་ཀྱི་དབྱེ་བས་མཆོད་པ་ལྔས་མཆོད་དོ། །མེ་ཏོག་སྙིམ་པར་གཞུག་པར་བྱ་ཞེས་བྱ་བ་ནི། དེའི་བྷ་ག་ལ་མེ་ཏོག་དང་། ཁུ་བ་གཞུག་པར་བྱའོ། །དེ་ལྟར་སྦྱིན་སྲེག་གི་ས་སྦྱང་བར་བྱས་པ་ཡིན་ནོ།
en: Thus, following the divisions of the types of activity, he should worship the consort with the five types of service, and offer a handful of flowers. He should place on her vulva blood or semen. In this way, the ground where the homa rite is to take place will be purified.

source: །དཀྱིལ་འཁོར་གྱི་ཆོ་ག་ལ་ཡང་གཞན་ཕལ་པ་མཆོག་གི་བུ་མོར་རྟོགས་པར་བྱའོ། །དཀྱིལ་འཁོར་གྱི་ཕྱིར་སྦྱིན་སྲེག་གི་ཆོ་ག་དེ་ཉེ་བར་བསྟན་པར་བྱ་སྟེ།
en: “A girl, one from a caste different than his own, should be instructed in the maṇḍala procedure.

source: གང་ལ་གསང་བ་ཆོས་ཀྱི་དཀྱིལ་འཁོར་དང་། ཕྱི་རོལ་གྱི་དཀྱིལ་འཁོར་ལ་ཡང་ཆོ་ག་འདིས་ཐིག་གདབ་པར་བྱ་ཞིང་།
en: As this pertains to the maṇḍala, she should also be instructed in the rites of homa, including the secret maṇḍala of phenomena.

source: རྡུལ་ཚོན་གྱི་དཀྱིལ་འཁོར་དང་། གསང་བ་ཆོས་ཀྱི་དཀྱིལ་འཁོར་ཇི་སྙེད་པའི་རང་གི་དམ་ཚིག་སྟེ།
en: Following this rule, he should measure out a twofold maṇḍala—the external one of colored powders, and the secret maṇḍala of phenomena that concerns his own samaya.

source: འདི་སྐད་དུ་རྣལ་འབྱོར་གྱི་གནས་སུ་གྱུར་པའི་སའི་ཕྱོགས་སུ་ཐབ་ཁུང་བྱའོ་ཞེས་བཀའ་སྩལ་ཏོ།
en: Accordingly, he should prepare a sacrificial fire pit in an area that is a place of pilgrimage for yogins.” So spoke the Blessed One. And he said further: “I will now teach the rite of homa

source: །སྣ་ཚོགས་ལས་ནི་རབ་བསྒྲུབ་ཕྱིར། །སྦྱིན་སྲེག་ལས་ནི་རབ་བཤད་བྱ།
en: That makes different rites effective.

source: །མེ་ནི་ལྷ་ཡི་ཁ་རུ་གསུངས།
en: Those gods among whom Agni is the foremost

source: །སྦྱིན་སྲེག་དེ་ཉིད་རྣམ་པར་གནས།
en: Are dependent upon the principle of homa.

source: །སྦྱིན་སྲེག་གིས་ནི་ལྷ་རྣམས་ཚིམ།
en: “Through oblation the gods are satiated;

source: །ཚིམ་ནས་དངོས་གྲུབ་རབ་ཏུ་སྩོལ།
en: When satiated, they grant success.

source: །གང་ཞིག་སྔགས་ཀྱི་ལྷག་ཆད་དག །སྦྱིན་སྲེག་གིས་ནི་དེ་ཀུན་དགང་།
en: Mantras that are recited inadequately or excessively,

source: །སྐུ་གསུམ་མཆོག་གི་རྩེ་ལས་སྐྱེས།
en: All become complete through homa.

source: །དེ་ཕྱིར་སྦྱིན་སྲེག་རབ་ཏུ་བསྔགས།
en: “Therefore homa is praised By the vajrins who possess the three bodies.

source: །གཙུབས་པ་ལས་ནི་བྱུང་བའི་མེས།
en: The fire obtained by whirling a stick

source: །དག་བྱེད་ལས་ནི་བྱེད་པར་འགྱུར།
en: Will make the rite beneficial.

source: །གདོལ་པའམ་དུར་ཁྲོད་སྐྱེས་པ་ནི།
en: “The fire obtained from an untouchable or from a charnel ground

source: །མི་དགེ་བ་ནི་རབ་ཏུ་བསྒྲུབ།
en: Will be effective in rites that bring harm. The pit should be round, or square,

source: །ཟླུམ་པོ་དང་ནི་གྲུ་བཞི་དང་། །ཟླ་ཕྱེད་དང་ནི་གྲུ་གསུམ་པ།
en: Or shaped like a crescent moon, or triangular.

source: །རྡོ་རྗེའི་མཚན་མའི་མུ་རན་དང་། །དཀྱིལ་འཁོར་གྲྭར་ནི་སྤྲོ་བར་བྱ།
en: “With its boundary marked with vajra scepters, The pit should fit within the outer circle. He who knows the nature of homa should place

source: །ཐབ་ཁུང་དབུས་སུ་གཙུག་ཏོར་དང་། །ཆུ་སྐྱེས་རྡོ་རྗེ་རིན་ཆེན་དང་། །པདྨ་གཞུག་པར་བྱ་བའོ། །སྦྱིན་སྲེག་དེ་ཉིད་ཆོག་རིམ་པས།
en: In the center of the pit, on top of a lotus, “A diadem, a lotus, a vajra scepter, or a jewel,

source: །རྣལ་འབྱོར་ཇི་བཞིན་གནས་ནས་ནི།
en: He should sit as specified ,

source: །པུས་མོའི་ནང་དུ་ལག་པ་ཉིད།
en: With his elbows between the knees.

source: །བླུགས་གཟར་མར་ཁུས་ཁྱབ་པས་ནི།
en: “The ladle for liquids should overflow with ghee

source: །དེ་བཞིན་དགང་གཟར་དགང་བླུགས་ཉིད།
en: So that the to be offered become saturated.

source: །གཡས་སུ་སྦྱིན་སྲེག་ཡོ་བྱད་གཞག །གཡོན་དུ་ཆུ་ཡི་སྣོད་ཉིད་དེ།
en: On the right side should be the materials to be burned, And on the left, a dish with water.

source: །མདུན་དུ་མཆོད་ཡོན་སྣོད་ཉིད་དོ།
en: “In front, there should be a dish with the welcome offering.

source: །ལས་ཀུན་བྱེད་པ་བཟླས་པས་ནི། །བསང་གཏོར་དང་ནི་འཐོར་འཐུང་བྱ།
en: While chanting the ‘all-purpose’ mantra, he should perform the rites of sprinkling and sipping of water.

source: །ཐབ་ཁུང་ཀུན་དུ་ཀུ་ཤ་ཡི། །རྩེ་མོ་དྲང་པོས་ཡོངས་སུ་བསྐོར།
en: He should encircle the pit all around with the straight tips of kuśa grass blades.

source: །མེ་ནི་འབར་བར་རིག་ནས་ནི།
en: “Observing that the fire has started,

source: །མེ་ལྷ་སྤྱན་ནི་དྲང་བར་བྱ།
en: He should summon the fire deity With the following mantra, following the rule,

source: །སྔགས་འདིས་ཆོ་ག་བཞིན་དུ་གཡས་པའི་མཐེ་བོང་དང་། མེ་འཇིགས་པ་གཡོ་བས།
en: Moving his right thumb in a gesture of fearlessness:

source: ཨོཾ་ཨེ་ཧྱེ་ཧི་མ་ཧཱ་བྷཱུ་ཏ་དེ་པ་རྀ་ཥི་དྭི་ཛ་སཏྟ་མ་གྲྀ་ཧཱི་ཏྭཱ་ཧུ་ཏི་མ་ཧཱ་ར་མ་སྨིན་སནྣི་ཧི་ཏོ་བྷ་བ།
en: “Come, come, O great god of beings, Best among the sages and twice born! Take the oblatory food And approach me!

source: ཨོྃ་ཨགྣེ་དཱི་པྱཱ་དཱི་པྱཱ་བི་ཤ་མ་ཧཱ་ཤྲི་ཡེ།
en: Oṁ , fire, blaze, blaze!

source: ཧ་བྱ་ཀ་བྱ་བཱ་ཧ་ན་ཡ་སྭཱ་ཧཱ།
en: Penetrate, O splendorous one, to carry away this burnt offering, svāhā

source: མཆོད་པ་ལྔ་ལ་གཡོན་པའི་རྡོ་རྗེས་བསང་གཏོར་བྱ་ཞིང་།
en: “He should consecrate the five articles of offering, Besprinkling them with the vajra scepter held in his left hand. He should visualize, arriving from the southeast,

source: མེའི་ཕྱོགས་ནས་བཀུག་པ་ལྟོ་བ་འཕྱང་ཞིང་མིག་གསུམ་པ་དང་། ཞལ་བཞི་པ་དང་། ཕྱག་བཞི་པ་དང་། ཁ་དོག་དམར་ཞིང་རལ་པ་ཆེན་པོ་དང་། མེའི་དཀྱིལ་འཁོར་ལ་གནས་ཤིང་ལས་ཀྱི་འོད་ཟེར་གྱིས་བརྒྱན་པ་སྟེ།
en: The god of fire with protruding belly, three eyes, “Four faces, four arms, red in color, And matted hair tied in a topknot. He is in the midst of a circle of fire And is adorned with the light rays of the four activities.

source: ལག་པ་དང་པོ་ན་མཆོག་སྦྱིན།
en: “His first right hand is in the boon-granting gesture;

source: གཉིས་པ་ན་བགྲང་ཕྲེང་།
en: In the second, he holds a rosary of rudrākṣa beads.

source: གཡོན་པ་ན་རིལ་བ་སྤྱི་བླུགས་ཉིད་དང་། གཉིས་པ་ན་དབྱིག་གུ་ཉིད།
en: In the first left hand he holds a water pitcher, And in the second, a staff.

source: ཁ་དོག་དམར་པོས་རྣམ་པར་བརྒྱན་ཅིང་དྲང་སྲོང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་འདི་ལྟ་བུའི་གཟུགས་སུ་བསམས་ནས་ཐབ་ཁུང་གི་དབུས་སུ་གཞུག་པར་བྱའོ།
en: “He is bedecked with red adornments And surrounded by a retinue of sages. Visualizing him in this form, He should cause him to enter the fire pit.

source: །དེའི་སྦྱིན་སྲེག་ཐམས་ཅད་ལ་ལན་གསུམ་གྱི་བར་དུ་སྲེག་བླུགས་སྦྱིན་ཏེ།
en: “The burnt offerings should be offered three times, Using up all the articles to be burned.

source: དེ་ནས་འཐོར་འཐུང་བྱས་ནས་འབར་བའི་རྣམ་པས་ཐིམ་པར་བྱའོ།
en: Next, he should perform the ritual sipping of water, And thereby transform the offerings into the form of flames.

source: །རིམ་པའི་སྦྱོར་བ་འདིས་ལྷ་རྣམས་མཁས་པས་ཚིམ་པར་བྱའོ།
en: “By applying this method stage by stage The wise practitioner will satiate the deity.

source: །ཚིམ་པར་བྱས་ནས་བཟོད་པར་གསོལ་ཏོ།
en: Having satiated and propitiated him,

source: །དངོས་གྲུབ་འདོད་པས་ཤེས་པར་བྱ་སྟེ།
en: He should tell him what accomplishments he desires. “Playfully he may assume the shapes of a parasol, A banner, a vajra scepter, a pitcher, a lotus, and a goad. His flames will have one, two, or three tongues, Shooting high, or burning low, or medium height. The wise practitioner will interpret these signs: In particular, if the flames swirl clockwise “And have a bright white color, He will interpret this as boding well. The flames may have the pure colors of a rainbow, Be smooth, and have the radiance of a firefly.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། རྡོ་རྗེ་དང་། བུམ་པ་དང་། པདྨ་དང་། ལྕགས་ཀྱུའི་དབྱིབས་དང་། རྩེ་གཅིག་པ་དང་། རྩེ་གཉིས་པ་དང་། རྩེ་གསུམ་པ་དང་། མཆོག་དང་། འབྲིང་དང་། ཐ་མ་དང་། ཁྱད་པར་དུ་གཡས་སུ་འཁྱིལ་བ་དང་། འབར་བའི་ཁ་དོག་དཀར་པོ་དང་། བཟང་པོའི་འཁྱིལ་བ་མཁས་པས་བརྟག་པར་བྱ་བ་དང་། བརྒྱ་བྱིན་གྱི་གཞུ་ལྟ་བུར་གཙང་བ་དང་། སྣུམ་པ་དང་། དབང་པོ་སྦས་པ་ལྟ་བུའི་འོད་དང་། ཀུ་སུམ་བྷ་དང་། བཻ་ཌཱུརྱ་ལྟ་བུ་དང་། དྲི་ཞིམ་པ་དང་། ཡིད་དུ་འོང་བ་དང་། གསེར་དང་། །དངུལ་ལྟ་བུ་དང་། དུ་བ་མེད་པ་དང་། ཉི་མ་ལྟ་བུ་འབར་བ་དང་། དྲི་མ་མེད་པ་དང་། ཞི་བ་ལ་ཁ་དོག་དཀར་པོ་ལྟ་བུ་དང་། རྒྱས་པ་ལ་ནི་སེར་པོ་ལྟ་བུ་དང་། རྗེས་སུ་ཆགས་པ་ལ་ནི་དམར་པོ་མཆོག་དང་། མངོན་སྤྱོད་ལ་ནི་སྔོན་པོ་དང་། ནག་པོ་དང་། མེ་ལྕེ་མང་བ་དང་། དུ་བ་དང་། མེ་སྟག་ཐམས་ཅད་ཡང་དག་པར་ལངས་པ་དང་། ཆུང་ངུ་ཆུང་ངུར་འཆད་པ་དང་། མྱུར་བར་གཟི་བརྗིད་ཆུང་བ་དང་། ནག་པོ་དང་བཅས་པ་དང་། པ་ལ་ཤའི་མདོག་དང་། རྩེ་གསུམ་པ་དང་། ཉི་མ་ལྟ་བུ་ཉིད་དང་། དེ་བཞིན་དུ་བ་གླང་གི་མགོ་ལྟ་བུ་ཉིད་དང་། རོའི་དྲི་དང་། ཉའི་དྲི་དང་། བོང་བུའི་དང་། ཁྱིའི་དང་། རྔ་མོའི་ནི་བགེགས་དང་། བགེགས་མེད་པའི་འབར་བའི་མཚན་མ་མཚོན་པར་བྱ་བ་ཡིན་ནོ།
en: “They may have the same hue as saffron or beryl, And be fragrant and pleasing to the mind, Shining like gold or silver, without smoke, Burning with the pure radiance of the sun. “White-colored flames are suitable for the rites of pacifying; For the rites of enriching they should be yellow. They should be red for acts of impassioning, And an exquisite deep blue or black for rites of assaulting. “Likewise, he should observe whether the fire has many flames and belches smoke and sparks, or whether it gradually rises or very slowly wanes. The fire may look unpleasant, or be dark green in color; it may resemble a spear or a sun, or the head of a cow. It may smell of a corpse or a cow, or possibly a donkey. He should thus divine by the signs of the fire whether there will be obstacles, and if so, he should neutralize them.

source: །མྱུར་བར་བཟླས་པ་དང་། བསྒོམ་པ་ལ་དགའ་བས་དེ་ལྟར་འགྲུབ་པར་འགྱུར་རོ།
en: “If he relies on mantra recitation and meditation, Every accomplishment will soon follow.

source: ཨོྃ་དང་པོ་དང་། སྭཱ་ཧཱ་མཐར་འགྲོ་བའི་སྔགས་བརྗོད་དོ།
en: “The mantra should begin with oṁ and end with svāhā

source: །ཞི་བ་དང་། རྒྱས་པ་དང་། དབང་ལ་རྒྱུན་མི་འཆད་པར་དབྱངས་སྦྱར་བར་བྱ་ཞིང་།
en: For the rites of pacifying, enriching, and enthralling, He should chant it as a song Without any breaks between individual sounds. “For the rite of pacifying, the practitioner should have a peaceful mind.

source: ཞི་བ་ལ་ཞི་བའི་ཡིད་དང་། རྒྱས་པ་ལ་ཚིམ་པས་མངོན་པར་འཕེལ་བར་འགྱུར་བ་དང་། དབང་ལ་དབང་གི་ཡིད་དང་། མྱོས་པར་བྱེད་ཅིང་ནང་གི་གུས་པ་དང་བཅས་པ་དང་། མངོན་སྤྱོད་ལ་ཧཱུྃ་དང་ཕཊ་ཀྱིས་ལུས་འབར་ཞིང་འབར་བ་དང་། འཇིག་རྟེན་གསུམ་བཟའ་བའི་སེམས་ཀྱི་ཆོ་གས་གནས་སོ།
en: For enriching, increase will come through adopting a satiated frame of mind. During the rite of enthralling, his mind should be enthralled, Intoxicated with love, and full of amorous wantonness. “If he follows the procedure for the rites of assaulting, He should engender thoughts of devouring the three realms. He should employ the syllables hūṁ and phaṭ While visualizing his body ablaze with flames.

source: །སྔགས་ཀྱི་ཡི་གེའི་རྐང་པ་ཡི།
en: “He should intersperse the words of supplication,

source: །ནང་དུ་ཆུད་པས་བསྐུལ་བས་སྦྱར།
en: Combining them with the syllables of the mantra.

source: །གང་ཡང་ཁ་དང་ལྡན་པའི་ལྷ།
en: Whatever gods are employed for whomever’s sake,

source: །སྣ་ཚོགས་ལས་ཀྱིས་མཆོད་པར་བྱ། །སྦྱིན་སྲེག་ཆོ་ག་ཐམས་ཅད་ལ།
en: He should worship them with various rites.

source: །སྔགས་ཀྱི་སྒྲུབ་པོས་ཆོ་ག་ཤེས་པས།
en: “The mantra adept who is familiar with the rules Involved in all the procedures of the homa rite

source: །དང་པོར་སྲེག་བླུགས་གང་བར་དབུལ།
en: Should first offer the complete burnt offering

source: །ཕྱི་ནས་ལས་ནི་བརྩམ་པར་བྱ།
en: And then commence with the activity.

source: །སྦྱིན་སྲེག་དེ་ཉིད་ཀྱིས་ནི་བསྐུལ།
en: “He should supplicate the deity employing the essence of homa—
